-- MySQL dump 10.13  Distrib 8.0.45, for Win64 (x86_64)
--
-- Host: 192.168.0.150    Database: lms
-- ------------------------------------------------------
-- Server version	8.4.8

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `boards`
--

DROP TABLE IF EXISTS `boards`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `boards` (
  `id` int NOT NULL AUTO_INCREMENT,
  `member_id` int NOT NULL,
  `title` varchar(200) COLLATE utf8mb4_general_ci NOT NULL,
  `content` text COLLATE utf8mb4_general_ci NOT NULL,
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `member_id` (`member_id`),
  CONSTRAINT `boards_ibfk_1` FOREIGN KEY (`member_id`) REFERENCES `members` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=115 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `boards`
--

LOCK TABLES `boards` WRITE;
/*!40000 ALTER TABLE `boards` DISABLE KEYS */;
INSERT INTO `boards` VALUES (1,3,'제목1','내용1','2026-01-28 14:30:55'),(2,3,'제목1','내용1','2026-01-28 14:31:31'),(3,3,'제목1','내용1','2026-01-28 14:31:34'),(4,4,'제목4','내용4','2026-01-28 14:31:34'),(5,4,'제목5','내용5','2026-01-28 14:31:34'),(12,2,'더미데이터','입력해주세요.','2026-02-02 15:10:10'),(16,2,'두쫀쿠 맛있어요!','두쫀쿠 먹어보세요.','2026-02-02 15:14:15'),(18,2,'날아다니는 꼬리는?','꾀꼬리~ 푸하하핳','2026-02-02 15:15:16'),(19,2,'저메추 받습니다.','1. 추운 날 얼큰한 짬뽕\r\n2. 목에 기름 칠 하게 삼쏘\r\n3. 장충동 왕족발보쌈 대신 세류동 굴보쌈족발 \r\n\r\n\r\n       ㄴ 3번\r\n       ㄴ 1번\r\n ','2026-02-02 15:18:23'),(21,12,'데이데이터','데미데이터','2026-02-02 15:21:58'),(23,14,'테일아 진화 시켜줘','워그레이몬 해줘','2026-02-02 15:22:19'),(24,15,'제목을 입력하세요','내용을 입력하세요','2026-02-02 15:22:20'),(25,17,'안녕하세요','저는 웹브라우저입니다.','2026-02-02 15:22:21'),(27,20,'안녕하세요','더미데이터','2026-02-02 15:22:45'),(36,19,'123','1234','2026-02-10 10:20:59'),(38,51,'감사합니다','감사합니다','2026-02-10 10:21:04'),(40,41,'더미데이터','더미데이터더미','2026-02-10 10:21:08'),(41,30,'aaaaa','aaaaa','2026-02-10 10:21:09'),(42,20,'테스트','내용입력','2026-02-10 10:21:13'),(43,31,'테스트','테스트 중 입니다.','2026-02-10 10:21:14'),(44,47,'안녕하세요 ','안녕하세요','2026-02-10 10:21:22'),(46,4,'테스트','테스트 1','2026-02-10 10:21:27'),(47,4,'테스트2','테스트2!','2026-02-10 10:21:33'),(48,4,'테스트3','테스트3!!','2026-02-10 10:21:40'),(49,4,'테스트4','테스트4!!!','2026-02-10 10:21:47'),(50,14,'내 앞에 사탕','종류 5가지','2026-02-10 10:21:50'),(51,4,'테스트5','테스트5!!!!!!','2026-02-10 10:21:55'),(52,41,'더미데이터','더미데이터더미','2026-02-10 10:22:00'),(53,30,'aaaaa','aaaaa','2026-02-10 10:22:52'),(54,47,'안녕하세요 ','안녕하세요','2026-02-10 10:22:56'),(55,47,'안녕하세요 ','안녕하세요','2026-02-10 10:22:59'),(56,47,'안녕하세요 ','안녕하세요','2026-02-10 10:23:19'),(57,30,'aaaaa','aaaaa','2026-02-10 10:23:46'),(59,31,'테스트','테스트 중 입니다.','2026-02-10 10:24:05'),(60,31,'123','45678','2026-02-10 10:25:13'),(61,14,'잘들어감?','안들어감?','2026-02-10 10:25:30'),(63,51,'감사합니다','감사합니다','2026-02-10 10:26:05'),(64,51,'감사합니다 (수정)','감사합니다 (수정)','2026-02-10 10:26:08'),(67,14,'피자먹고싶은데','파인애플피자어떠심들','2026-02-10 10:27:29'),(68,14,'치킨도 좋은듯','순살치킨먹고싶다','2026-02-10 10:28:10'),(71,14,'잘됨?','안됨','2026-02-10 10:29:23'),(72,47,'ㅇㅇㅇㅇㅇ','ㅇㅇㅇㅇㅇ','2026-02-10 10:29:31'),(73,20,'테스트28(수정테스트)','점심고민중(수정테스트)','2026-02-10 10:29:53'),(74,31,'테스트(수정테스트)의 (수정테스트)','테스트 중 입니다.\r\n(수정테스트)의 (수정테스트)','2026-02-10 10:30:51'),(77,43,'ddd','dddd','2026-02-10 10:31:12'),(78,2,'프론트 테스트 1(수정테스트)','프론트 테스트 1(수정테스트)','2026-02-10 10:31:18'),(80,42,'dbdb딥','db손해보험','2026-02-10 10:47:11'),(81,14,'글쓰기 버튼','잘 작동하ㅔㄴ','2026-02-10 10:50:22'),(83,47,'글쓰기테스트(수정)','테스트(수정)','2026-02-10 11:00:20'),(84,30,'aaaa','aaaa','2026-02-10 11:00:20'),(85,14,'배고프다(수정)','점심시간 1 20분 멀다(수정)','2026-02-10 11:00:31'),(86,20,'글쓰기 테스트','내용입력','2026-02-10 11:00:46'),(89,43,'dd','ddd','2026-02-10 11:03:48'),(90,19,'ㅇㅅㅇ (게시글 수정)','ㅇㅁㅇ','2026-02-10 11:03:52'),(92,41,'asd(수정 테스트.)','sfsa(수정 테스트.)','2026-02-10 11:04:13'),(94,3,'감기조심하세요~','내몸내산','2026-02-10 11:06:35'),(95,43,'qq','qqq','2026-02-10 11:07:11'),(96,43,'zzz','zzz','2026-02-10 11:07:42'),(97,43,'zzz','zzz','2026-02-10 11:09:57'),(100,54,'100번째','영광','2026-02-10 11:32:39'),(113,22,'착한 김밥이 죽으면 어디로 갈까요?','김밥천국 E=E=E=┌( ￣∇￣)┘ 후다닥!!\r\n        ㄴ 와..','2026-02-10 12:45:50'),(114,40,'성적조회','하는날','2026-02-11 09:52:11');
/*!40000 ALTER TABLE `boards` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-02-12  9:52:29
